schreibfaul1/ESP32-MiniWebRadio/src/common.h
int8_t   s_state = NONE; // statemaschine
int8_t   s_lastState = NONE;
int8_t   s_subState = UNDEFINED;
int8_t   s_subState_radio = UNDEFINED;
int8_t   s_subState_player = UNDEFINED;
int8_t   s_subState_clock = UNDEFINED;
int8_t   s_subState_weather = UNDEFINED;
int8_t   s_ir_btn_select = UNDEFINED; // IR menue item
int8_t   s_currDLNAsrvNr = -1;
int8_t   s_alarmSubMenue = -1;
int8_t   s_sleepTimerSubMenue = -1;
uint8_t  s_alarmdays = 0;
uint8_t  s_cur_Codec = 0;
uint8_t  s_numServers = 0; //
uint8_t  s_level = 0;
uint8_t  s_sleepMode = 1; // 0 display off, 1 show the clock
uint8_t  s_staListPos = 0;
uint8_t  s_cthFailCounter = 0; // connecttohost fail
uint8_t  s_itemListPos = 0;    // DLNA items
uint8_t  s_fileListPos = 0;
uint8_t  s_ambientValue = 50;
uint8_t  s_dlnaLevel = 0;
uint8_t  s_resetReason = (esp_reset_reason_t)ESP_RST_UNKNOWN;
uint8_t  s_brightness = UINT8_MAX / 2;
uint8_t  s_start_counter = 0;
int16_t  s_totalNumberReturned = -1;
int16_t  s_dlnaMaxItems = -1;
int16_t  s_dlnaMaXServers = -1;
int16_t  s_alarmtime[7] = {0};  // in minutes (23:59 = 23 *60 + 59) [0] Sun, [1] Mon
int16_t  s_cur_AudioFileNr = 0; // this is the position of the file within the (alpha ordered) folder starting with 0
uint16_t s_staListNr = 0;
uint16_t s_fileListNr = 0;
uint16_t s_cur_station = 0; // current station(nr), will be set later
uint16_t s_sleeptime = 0;   // time in min until MiniWebRadio goes to sleep
uint16_t s_plsCurPos = 0;
uint16_t s_dlnaItemNr = 0;
uint16_t s_h_resolution = 320;
uint16_t s_v_resolution = 240;
uint32_t s_icyBitRate = 0;     // from http response header via event
uint32_t s_decoderBitRate = 0; // from decoder via getBitRate(false)
uint32_t s_playlistTime = 0;   // playlist start time millis() for timeout
uint32_t s_settingsHash = 0;
uint32_t s_audioFileSize = 0;
uint32_t s_media_downloadPort = 0;
uint32_t s_audioCurrentTime = 0;
uint32_t s_timestamp = 0;
uint32_t s_audioFileDuration = 0;
uint64_t s_totalRuntime = 0; // total runtime in seconds since start

ps_ptr<char> s_streamTitle;
ps_ptr<char> s_myIP = "000.000.000.000";
ps_ptr<char> s_cur_AudioFolder = "/audiofiles/";
ps_ptr<char> s_icyDescription;
ps_ptr<char> s_cur_AudioFileName;
ps_ptr<char> s_stationURL;
ps_ptr<char> s_stationName_air;
ps_ptr<char> s_homepage;
ps_ptr<char> s_TZName = "Europe/Berlin";
ps_ptr<char> s_TZString = "CET-1CEST,M3.5.0,M10.5.0/3";
ps_ptr<char> s_timeSpeechLang = "en";
ps_ptr<char> s_lyrics = "";
ps_ptr<char> s_location = "Europe/Berlin";
ps_ptr<char> s_latiitude = "52.52";
ps_ptr<char> s_longitude = "13.41";
ps_ptr<char> s_temperature_unit = "C";   // *C or °F
ps_ptr<char> s_pressure_unit = "hPa";    // hPa or mmHg
ps_ptr<char> s_wind_speed_unit = "km/h"; // km/h, m/s, bft
ps_ptr<char> s_version;

#include "mwr_src/classes.hpp"

dlnaHistory_s  s_dlnaHistory[10];
timecounter_s  s_timeCounter;
SD_content     s_SD_content;
Playlist       playlist;
IR_buttons     irb(&s_settings);
IR             ir(IR_PIN); // do not change the objectname, it must be "ir"
File           audioFile;
FtpServer      ftpSrv;
DLNA_Client    dlna;
KCX_BT_Emitter bt_emitter(BT_EMITTER_RX, BT_EMITTER_TX, BT_EMITTER_CONNECT, BT_EMITTER_MODE);
hp_BH1750      BH1750; // create the sensor
ES8311         es8311;
METEO          meteo;
RTIME::rtime   s_time;
TCA9554        tca9554;

std::deque<ps_ptr<char>> s_PLS_content;
ps_ptr<char>             codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "OPUS", "VORBIS", "OGG"};
stationManagement        staMgnt(&s_cur_station);

// prototypes (main.cpp)
boolean      defaultsettings();
void         updateSettings();
void         fall_asleep();
void         wake_up(int8_t state, int8_t substate);
void         setRTC(ps_ptr<char> TZString);
boolean      isAlarm(uint8_t weekDay, uint8_t alarmDays, uint16_t minuteOfTheDay, int16_t* alarmTime);
boolean      copySDtoFFat(const char* path);
void         showStationName();
void         showStreamTitle(ps_ptr<char> streamTitle);
void         showLogoAndStationName();
ps_ptr<char> getStationName();
ps_ptr<char> getLogoPath();
void         webSrv_send_station_items();
void         showFileLogo(int8_t state, int8_t subState);
void         showPlayerFileName(ps_ptr<char> fname);
void         show_DLNA_FileName(ps_ptr<char> fname);
void         showPlsFileNumber();
void         showAudioFileNumber();
void         display_sleeptime(int8_t ud = 0);
boolean      drawImage(ps_ptr<char> path, uint16_t posX, uint16_t posY, uint16_t maxWidth = 0, uint16_t maxHeigth = 0);
boolean      isAudio(ps_ptr<char> path);
bool         connectToWiFi();
void         setWiFiCredentials(ps_ptr<char> ssid, ps_ptr<char> password);
ps_ptr<char> scaleImage(ps_ptr<char> path);
bool         detect_i2_c_devices(TwoWire* twi, int8_t sda, int8_t scl, i2c_items_s* i2c_items);
void         set_tft_items();
void         set_tp_items();
bool         init_SD_card();
void         setVolume(uint8_t vol);
uint8_t      downvolume();
uint8_t      upvolume();
void         setStation(ps_ptr<char> url, ps_ptr<char> extension = {});
void         setStation(uint16_t sta);
ps_ptr<char> getFlagPath(uint16_t station);
void         nextStation();
void         prevStation();
void         setStationByNumber(uint16_t staNr);
void         WEBSRV_onCommand(ps_ptr<char> cmd, ps_ptr<char> param, ps_ptr<char> arg);
void         WEBSRV_onRequest(ps_ptr<char> cmd, ps_ptr<char> param, ps_ptr<char> arg, ps_ptr<char> contentType, uint32_t contentLength);
void         WEBSRV_onDelete(ps_ptr<char> cmd, ps_ptr<char> param, ps_ptr<char> arg);
void         savefile(ps_ptr<char> fileName, uint32_t contentLength, ps_ptr<char> contenttype);
void         setI2STone();
ps_ptr<char> getI2STone();
void         SD_playFile(ps_ptr<char> pathWoFileName, ps_ptr<char> fileName);
void         SD_playFile(ps_ptr<char> path, uint32_t resumeFilePos = 0, bool showFN = true);
bool         SD_rename(ps_ptr<char> src, ps_ptr<char> dest);
bool         SD_newFolder(ps_ptr<char> folderPathName);
bool         SD_delete(ps_ptr<char> itemPath);
void         processPlaylist();
void         changeState(int8_t state, int8_t subState);
void         connecttohost(ps_ptr<char> host);
void         connecttoFS(const char* FS, ps_ptr<char> filename, uint32_t fileStartTime = 0);
void         stopSong();
void         placingGraphicObjects();
void         muteChanged(bool m);
void         setTimeCounter(uint8_t sec);
void         setTFTbrightness(uint8_t brightness);
ps_ptr<char> get_WiFi_PW(const char* ssid);
void         my_audio_info(Audio::msg_t m);
void         on_dlna_client(const DLNA_Client::msg_s& msg);
void         on_kcx_bt_emitter(const KCX_BT_Emitter::msg_s& msg);
void         on_websrv(const WebSrv::msg_s& msg);
void         on_meteo(const METEO::msg_s& msg);
void         tp_pressed(uint16_t x, uint16_t y);
void         tp_long_pressed(uint16_t x, uint16_t y);
void         tp_moved(uint16_t x, uint16_t y);
void         tp_released(uint16_t x, uint16_t y);
inline void  get_registered_names();
inline void  clearLogo();
inline void  clearStationName();
void         timer100ms();

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

bool setupBacklight(int pin, uint32_t freq_hz) {
    if (pin < 0) return false;

    ledc_channel_config_t ch =
        {.gpio_num = (gpio_num_t)pin, .speed_mode = LEDC_LOW_SPEED_MODE, .channel = LEDC_CHANNEL_1, .intr_type = LEDC_INTR_DISABLE, .timer_sel = LEDC_TIMER_3, .duty = 0, .hpoint = 0};

    ledc_timer_config_t tmr = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .duty_resolution = LEDC_TIMER_8_BIT,
        .timer_num = LEDC_TIMER_3,
        .freq_hz = freq_hz,
        .clk_cfg = LEDC_AUTO_CLK,
    };

