schreibfaul1/ESP32-MiniWebRadio/src/common.h
    // Timer zuerst initialisieren
    ledc_timer_config(&tmr);

    // Dann Channel anlegen
    ledc_channel_config(&ch);

    // Optional Helligkeit setzen
    ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1, 127);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1);
    return true;
}

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌   H A R D C O P Y    📌📌📌
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void writeDirect(File& file, int32_t width, int32_t height) {
    uint16_t row[width];
    for (int32_t y = height - 1; y >= 0; y--) {
        getTFT().readRect(0, y, width, 1, row);
        file.write((uint8_t*)row, width * sizeof(uint16_t));
    }
}

void writeRotated90(File& file, int32_t width, int32_t height) {
    uint16_t column[height];
    for (int32_t y = 0; y < width; y++) {
        getTFT().readRect(y, 0, 1, height, column);
        file.write((uint8_t*)column, height * sizeof(uint16_t));
    }
}

void writeRotated180(File& file, int32_t width, int32_t height) {
    uint16_t row[width];
    for (int32_t y = 0; y < height; y++) {
        getTFT().readRect(0, y, width, 1, row);
        std::reverse(row, row + width);
        file.write((uint8_t*)row, width * sizeof(uint16_t));
    }
}

void writeRotated270(File& file, int32_t width, int32_t height) {
    uint16_t column[height];
    for (int32_t y = width - 1; y >= 0; y--) {
        getTFT().readRect(y, 0, 1, height, column);
        std::reverse(column, column + height);
        file.write((uint8_t*)column, height * sizeof(uint16_t));
    }
}

void make_hardcopy_on_sd() {
    const uint8_t bmp320x240[70] = {
        0x42, 0x4D, 0x46, 0x58, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x46, 0x00, 0x00, 0x00, 0x38, 0x00, 0x00, 0x00, 0x40, 0x01, 0x00, 0x00, 0xF0, 0x00,
        0x00, 0x00, 0x01, 0x00, 0x10, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x58, 0x02, 0x00, 0x23, 0x2E, 0x00, 0x00, 0x23, 0x2E, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xF8, 0x00, 0x00, 0xE0, 0x07, 0x00, 0x00, 0x1F, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    };
    (void)bmp320x240;

    const uint8_t bmp480x320[70] = {
        0x42, 0x4D, 0x46, 0xB0, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x46, 0x00, 0x00, 0x00, 0x38, 0x00, 0x00, 0x00, 0xE0, 0x01, 0x00, 0x00, 0x40, 0x01,
        0x00, 0x00, 0x01, 0x00, 0x10, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0xB0, 0x04, 0x00, 0x23, 0x2E, 0x00, 0x00, 0x23, 0x2E, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xF8, 0x00, 0x00, 0xE0, 0x07, 0x00, 0x00, 0x1F, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    };
    (void)bmp480x320;

    const uint8_t bmp800x480[70] = {
        0x42, 0x4D, 0x46, 0xC4, 0x0B, 0x00, 0x00, 0x00, 0x00, 0x00, // BM + File size 768070
        0x46, 0x00, 0x00, 0x00,                                     // Pixel data offset (70 bytes)
        0x28, 0x00, 0x00, 0x00,                                     // DIB header size
        0x20, 0x03, 0x00, 0x00,                                     // Width: 800
        0xE0, 0x01, 0x00, 0x00,                                     // Height: 480
        0x01, 0x00,                                                 // Color planes
        0x10, 0x00,                                                 // Bit count: 16 (RGB565)
        0x03, 0x00, 0x00, 0x00,                                     // Compression: BI_BITFIELDS (3)
        0x00, 0xB0, 0x04, 0x00,                                     // Image size (kept same, optional)
        0x23, 0x2E, 0x00, 0x00,                                     // X pixels per meter
        0x23, 0x2E, 0x00, 0x00,                                     // Y pixels per meter
        0x00, 0x00, 0x00, 0x00,                                     // Colors used
        0x00, 0x00, 0x00, 0x00,                                     // Important colors
        0x00, 0xF8, 0x00, 0x00,                                     // Red mask
        0xE0, 0x07, 0x00, 0x00,                                     // Green mask
        0x1F, 0x00, 0x00, 0x00,                                     // Blue mask
        0x00, 0x00, 0x00, 0x00                                      // Alpha mask (optional, empty)
    };
    (void)bmp800x480;

    const uint8_t bmp1024x600[70] = {
        0x42, 0x4D,             // 'BM'
        0x46, 0xC0, 0x12, 0x00, // File size: 1,228,870
        0x00, 0x00, 0x00, 0x00, // Reserved
        0x46, 0x00, 0x00, 0x00, // Pixel data offset (70)
        0x28, 0x00, 0x00, 0x00, // DIB header size (40)
        0x00, 0x04, 0x00, 0x00, // Width: 1024
        0x58, 0x02, 0x00, 0x00, // Height: 600
        0x01, 0x00,             // Planes
        0x10, 0x00,             // BitCount: 16 (RGB565)
        0x03, 0x00, 0x00, 0x00, // Compression: BI_BITFIELDS
        0x00, 0xC0, 0x12, 0x00, // Image size
        0x23, 0x2E, 0x00, 0x00, // X pixels per meter
        0x23, 0x2E, 0x00, 0x00, // Y pixels per meter
        0x00, 0x00, 0x00, 0x00, // Colors used
        0x00, 0x00, 0x00, 0x00, // Important colors
        0x00, 0xF8, 0x00, 0x00, // Red mask
        0xE0, 0x07, 0x00, 0x00, // Green mask
        0x1F, 0x00, 0x00, 0x00, // Blue mask
        0x00, 0x00, 0x00, 0x00  // Alpha mask
    };
    (void)bmp1024x600;

    File hc = SD_MMC.open("/hardcopy.bmp", "w", true);
#ifdef TFT_LAYOUT_S
    hc.write(bmp320x240, sizeof(bmp320x240));
    if (TFT_ROTATION == 0) writeDirect(hc, 320, 240);
    if (TFT_ROTATION == 1) writeRotated90(hc, 240, 320);
    if (TFT_ROTATION == 2) writeRotated180(hc, 320, 240);
    if (TFT_ROTATION == 3) writeRotated270(hc, 240, 320);
    hc.close();
#elifdef TFT_LAYOUT_M
    hc.write(bmp480x320, sizeof(bmp480x320));
    if (TFT_ROTATION == 0) writeDirect(hc, 480, 320);
    if (TFT_ROTATION == 1) writeRotated90(hc, 320, 480);
    if (TFT_ROTATION == 2) writeRotated180(hc, 480, 320);
    if (TFT_ROTATION == 3) writeRotated270(hc, 320, 480);
    hc.close();
#elifdef TFT_LAYOUT_L
    hc.write(bmp800x480, sizeof(bmp800x480));
    if (TFT_ROTATION == 0) writeDirect(hc, 800, 480);
    if (TFT_ROTATION == 1) writeRotated90(hc, 480, 800);
    if (TFT_ROTATION == 2) writeRotated180(hc, 800, 480);
    if (TFT_ROTATION == 3) writeRotated270(hc, 480, 800);
    hc.close();
#elifdef TFT_LAYOUT_XL
    hc.write(bmp1024x600, sizeof(bmp1024x600));
    if (TFT_ROTATION == 0) writeDirect(hc, 1024, 600);
    if (TFT_ROTATION == 1) writeRotated90(hc, 600, 1024);
    if (TFT_ROTATION == 2) writeRotated180(hc, 1024, 600);
    if (TFT_ROTATION == 3) writeRotated270(hc, 600, 1024);
    hc.close();
#else

#endif
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌   U S E R   I N P U T    📌📌📌
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void ui_pause_resume() {
    bool res = audio.pauseResume();
    if (!res) { printfln(s_tag.terminal, ANSI_ESC_YELLOW "Pause-Resume not possible"); }
    s_f_pauseResume = audio.isRunning();
    if (s_f_pauseResume) {
        printfln(s_tag.terminal, ANSI_ESC_YELLOW "Pause-Resume --> resume");
    } else {
        printfln(s_tag.terminal, ANSI_ESC_YELLOW "Pause-Resume --> pause");
    }
}
void ui_runtimeStats() {
    ps_ptr<char> timeStatsBuffer;
    timeStatsBuffer.set_name("timeStatsBuffer");
    GetRunTimeStats(timeStatsBuffer);
    { printfln(s_tag.terminal, ANSI_ESC_YELLOW "task statistics\n\n{}", timeStatsBuffer); }
}
void ui_localFile(uint16_t s) {
    const char* path = "/audiofiles/sample.mp3";
    uint16_t    fileStart = s;
    printfln(s_tag.terminal, ANSI_ESC_YELLOW "path: {}, fileStart {}s", path, fileStart);
    connecttoFS("SD_MMC", path, fileStart);
}
void ui_connecttospeech() {
    audio.connecttospeech("Hallo, wie geht es dir? Morgen scheint die Sonne und übermorgen regnet es.Aber wir nehmen den Regenschirm mit. Und auch den Rucksack. Dann lesen wir aus dem Buch "
                          "Hier gibt es nur gutes Wetter.",
                          "de");
}
void ui_bufferFilled() {
    printfln(s_tag.terminal, "inBuffer filled {} bytes", audio.inBufferFilled());
    printfln(s_tag.terminal, "inBuffer free   {} bytes", audio.inBufferFree());
}
void ui_fontTest(uint16_t s) {
    if (s == 0) s_streamTitle = "We’re Going To Ibiza";
    if (s == 1) s_streamTitle = "Á á É é Í í Ó ó Ő ő Ú ú Ű ű";
    if (s == 2) s_streamTitle = "Č č Ć ć Š š Ž ž Đ đ Ł ł Ń ń Ś ś Ź ź Ż ż";
    if (s == 3) s_streamTitle = "Ő ő Ű ű € – ← ’ “ ” …🔵🟥";
    if (s == 4) s_streamTitle = "Ă ă Â â Î î Ș ș Ț ț Ş ş Ţ ţ Ş ş Ţ ţ";
    if (s == 5) s_streamTitle = "A B C D E F G H I K L J M y O P Q R";
    printfln(s_tag.terminal, "st: {}", s_streamTitle);
    s_f_newStreamTitle = true;
}
void ui_setTimeOffset(int16_t s) {
    printfln(s_tag.terminal, "setTimeOffset {}", s);
    audio.setTimeOffset(s);
}
void ui_setPlayTime(int16_t s) {
    printfln(s_tag.terminal, "setAudioPlayTime {}", s);
    audio.setAudioPlayTime(s);
}
void ui_getAudioFilePosition() {
    printfln(s_tag.terminal, "getAudioFilePosition {}", audio.getAudioFilePosition());
}
void ui_setAudioFilePos(uint32_t s) {
    printfln(s_tag.terminal, "setAudioFilePosition {}", s);
    audio.setAudioFilePosition(s);
}
void ui_getRegistredNames() {
    get_registered_names();
}
void ui_forceMono() {
    static bool f_mono = false;
    f_mono = !f_mono;
    audio.forceMono(f_mono);
    if (f_mono)
        printfln(s_tag.terminal, "mono");
    else
        printfln(s_tag.terminal, "stereo");
}
void ui_setMute() {
    static bool f_mute = false;
    f_mute = !f_mute;
    audio.setMute(f_mute);
    if (f_mute)
        printfln(s_tag.terminal, "mute on");
    else
        printfln(s_tag.terminal, "mute off");
}
void ui_output48KHz() {
    static bool f_o48 = false;
    f_o48 = !f_o48;
    if (f_o48) {
        audio.setOutputSampleRate(Audio::SR_48000);
        printfln(s_tag.terminal, "output 48KHz");
    } else {
        audio.setOutputSampleRate(Audio::SR_ORIGIN);
        printfln(s_tag.terminal, "normal output {} Hz", audio.getSampleRate());
    }
}
void ui_output44KHz() {
    static bool f_o44 = false;
    f_o44 = !f_o44;
    if (f_o44) {
        audio.setOutputSampleRate(Audio::SR_44100);
        printfln(s_tag.terminal, "output 44.1KHz");
    } else {
        audio.setOutputSampleRate(Audio::SR_ORIGIN);
        printfln(s_tag.terminal, "normal output {} Hz", audio.getSampleRate());
    }
}
void ui_btProtocol() {
    bt_emitter.list_protokol();
}
void ui_btCommand(ps_ptr<char> cmd) {
    bt_emitter.userCommand(cmd);
    printfln(s_tag.terminal, "btstr: {}", cmd);
}
void ui_meteoRequest() {
    meteo.send_request();
}
void ui_meteoProtocol() {
    meteo.protocol();
}
void ui_timeSpeech() {
    s_f_timeSpeech = !s_f_timeSpeech;
    if (s_f_timeSpeech) {
        printfln(s_tag.terminal, "time speech is on");
    } else {
        printfln(s_tag.terminal, "time speech is off");
    }
}
void ui_setWiFiPWD() {
    changeState(WIFI_SETTINGS, 0);
}
void ui_openAIspeech() {
    printfln(s_tag.terminal, "openAI speech");
    audio.openai_speech("openAI-key", "tts-1", "Today is a wonderful day to build something people love!", "", "shimer", "mp3", "1");
}
uint32_t song_time = 0;
void     ui_stopSong() {
    song_time = audio.stopSong();
    printfln(s_tag.terminal, "file {} stopped at time {}", s_cur_AudioFileName, song_time);
}
void ui_start_song() {
    ps_ptr<char> path = "/audiofiles/" + s_cur_AudioFileName;
    bool         ret = audio.connecttoFS(SD_MMC, path.c_get(), song_time);
    printfln(s_tag.terminal, "file {} started at time {}, ret {}", s_cur_AudioFileName, song_time, ret);
}
void ui_get_bitRate() {
    uint32_t br = audio.getBitRate();
    printfln(s_tag.terminal, "bitrate: {}", br);
}
void ui_get_inbuffStatus() {
    audio.inBufferStatus();
}
void ui_isRunning() {
    printfln(s_tag.terminal, "is running: {}", audio.isRunning());
}
void ui_volFadingSpeed(float s) {
    printfln(s_tag.terminal, "set volume fading speed {}, current: {}", s, audio.settings.VOL_FADING_SPEED);
    audio.settings.VOL_FADING_SPEED = s;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void user_input(ps_ptr<char> input) {

    printfln(s_tag.terminal, ANSI_ESC_YELLOW "{}", input);

    if (input == "pr") ui_pause_resume();                                          // pause resume
    if (input == "rts") ui_runtimeStats();                                         // get runtime stats
    if (input.starts_with("lf")) ui_localFile(input.substr(2).to_uint16());        // file starts at 30s; lf30
    if (input == "cts") ui_connecttospeech();                                      // connect to speech
    if (input == "bfi") ui_bufferFilled();                                         // buffer filled
    if (input.starts_with("ft")) ui_fontTest(input.substr(2).to_uint16());         // test some characters shown as streamTitle
    if (input.starts_with("stoff")) ui_setTimeOffset(input.substr(5).to_int16());  // set offset +- x seconds; stoff-25
    if (input.starts_with("sapt")) ui_setPlayTime(input.substr(4).to_int16());     // set audio playtime at x seconds
    if (input == "gafp") ui_getAudioFilePosition();                                // getAudioFilePosition
    if (input.starts_with("safp")) ui_setAudioFilePos(input.substr(4).to_int32()); // setAudioFilePosition
    if (input == "grn") ui_getRegistredNames();                                    // list of all self registered objects
    if (input == "fomo") ui_forceMono();                                           // force mono
    if (input == "sem") ui_setMute();                                              // set mute
    if (input == "o48") ui_output48KHz();                                          // output48KHz
    if (input == "o44") ui_output44KHz();                                          // output44KHz
    if (input == "btp") ui_btProtocol();                                           // blurtooth kcx protocol
    if (input.starts_with("btcmd")) ui_btCommand(input.substr(6));                 // bluetooth command, send to bt emitter e.g. btstr:AT+
    if (input == "meteor") ui_meteoRequest();                                      // open meteo update request
    if (input == "meteop") ui_meteoProtocol();                                     // open meteo update protocol
    if (input == "tsp") ui_timeSpeech();                                           // toogle time speech
    if (input == "pwd") ui_setWiFiPWD();                                           // set password for WiFi
    if (input == "oais") ui_openAIspeech();                                        // openAIspeech
    if (input == "stops") ui_stopSong();                                           // stop song
    if (input == "starts") ui_start_song();                                        // start song
    if (input == "gbr") ui_get_bitRate();                                          // get bitrate
    if (input == "gibs") ui_get_inbuffStatus();                                    //  // get inbuff status
    if (input == "ir") ui_isRunning();                                             // is running?
    if (input.starts_with("vfs")) ui_volFadingSpeed(input.substr(3).to_float());   // volume fading speed
}